wsdl/recording_service.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.onvif.org/ver10/recording/wsdl" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://www.onvif.org/ver10/recording/wsdl" name="RecordingService">
  <types>
    <xs:schema targetNamespace="http://www.onvif.org/ver10/recording/wsdl">
      <xs:complexType name="RecordingScheduleItem">
        <xs:sequence>
          <xs:element name="Start" type="xs:string" minOccurs="1" />
          <xs:element name="End" type="xs:string" minOccurs="1" />
          <xs:element name="Mode" type="xs:string" minOccurs="0" />
        </xs:sequence>
      </xs:complexType>
      <xs:complexType name="RecordingSchedule">
        <xs:sequence>
          <xs:any minOccurs="0" maxOccurs="unbounded" processContents="lax" />
        </xs:sequence>
      </xs:complexType>
      <xs:complexType name="RecordingConfiguration">
        <xs:sequence>
          <xs:element name="Mode" type="xs:string" />
          <xs:element name="Schedule" type="tns:RecordingSchedule" minOccurs="0" />
        </xs:sequence>
      </xs:complexType>
    </xs:schema>
  </types>

  <message name="GetRecordingConfigurationRequest" />
  <message name="GetRecordingConfigurationResponse">
    <part name="RecordingConfiguration" element="tns:RecordingConfiguration" />
  </message>

  <message name="SetRecordingConfigurationRequest">
    <part name="RecordingConfiguration" element="tns:RecordingConfiguration" />
  </message>
  <message name="SetRecordingConfigurationResponse">
    <part name="RecordingConfiguration" element="tns:RecordingConfiguration" />
  </message>

  <message name="SetRecordingModeRequest">
    <part name="Mode" type="xs:string" />
  </message>
  <message name="SetRecordingModeResponse">
    <part name="RecordingConfiguration" element="tns:RecordingConfiguration" />
    <part name="Mode" type="xs:string" />
  </message>

  <message name="SetRecordingScheduleRequest">
    <part name="Schedule" element="tns:RecordingSchedule" />
  </message>
  <message name="SetRecordingScheduleResponse">
    <part name="RecordingConfiguration" element="tns:RecordingConfiguration" />
    <part name="Schedule" element="tns:RecordingSchedule" />
  </message>

  <portType name="RecordingPortType">
    <operation name="GetRecordingConfiguration">
      <input message="tns:GetRecordingConfigurationRequest" />
      <output message="tns:GetRecordingConfigurationResponse" />
    </operation>
    <operation name="SetRecordingConfiguration">
      <input message="tns:SetRecordingConfigurationRequest" />
      <output message="tns:SetRecordingConfigurationResponse" />
    </operation>
    <operation name="SetRecordingMode">
      <input message="tns:SetRecordingModeRequest" />
      <output message="tns:SetRecordingModeResponse" />
    </operation>
    <operation name="SetRecordingSchedule">
      <input message="tns:SetRecordingScheduleRequest" />
      <output message="tns:SetRecordingScheduleResponse" />
    </operation>
  </portType>

  <binding name="RecordingBinding" type="tns:RecordingPortType">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http" />
    <operation name="GetRecordingConfiguration">
      <soap:operation soapAction="http://www.onvif.org/ver10/recording/wsdl/GetRecordingConfiguration" />
      <input><soap:body use="literal" /></input>
      <output><soap:body use="literal" /></output>
    </operation>
    <operation name="SetRecordingConfiguration">
      <soap:operation soapAction="http://www.onvif.org/ver10/recording/wsdl/SetRecordingConfiguration" />
      <input><soap:body use="literal" /></input>
      <output><soap:body use="literal" /></output>
    </operation>
    <operation name="SetRecordingMode">
      <soap:operation soapAction="http://www.onvif.org/ver10/recording/wsdl/SetRecordingMode" />
      <input><soap:body use="literal" /></input>
      <output><soap:body use="literal" /></output>
    </operation>
    <operation name="SetRecordingSchedule">
      <soap:operation soapAction="http://www.onvif.org/ver10/recording/wsdl/SetRecordingSchedule" />
      <input><soap:body use="literal" /></input>
      <output><soap:body use="literal" /></output>
    </operation>
  </binding>

  <service name="RecordingService">
    <port name="Recording" binding="tns:RecordingBinding">
      <soap:address location="http://0.0.0.0:0/onvif/recording_service" />
    </port>
  </service>
</definitions>
