nxvpro/Resources/soap_recording.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
	<s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
		<GetRecordingConfiguration xmlns="http://www.onvif.org/ver10/recording/wsdl">
			<RecordingToken>_REC_TOKEN_</RecordingToken>
		</GetRecordingConfiguration>
	</s:Body>
</s:Envelope>
